#### BuiltInFailures.FluidFailures Members

---

|  |
| --- |
| BuiltInFailures FluidFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures FluidFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | UndefinedFluidType | The fluid type '[Type Name]' is not defined |

# See Also

BuiltInFailures FluidFailures Class

Autodesk.Revit.DB Namespace